{"config": [{"config": {"output_dim": 30, "init": "uniform", "input_length": 150, "name": "embedding_2", "input_dim": 138, "W_constraint": null, "input_dtype": "int32", "mask_zero": true, "W_regularizer": null, "batch_input_shape": [null, 150], "activity_regularizer": null, "dropout": 0.0, "trainable": true}, "class_name": "Embedding"}, {"config": {"output_dim": 50, "init": "glorot_uniform", "input_length": null, "name": "lstm_2", "input_dim": 30, "inner_activation": "hard_sigmoid", "U_regularizer": null, "dropout_U": 0.0, "unroll": false, "return_sequences": false, "stateful": false, "forget_bias_init": "one", "inner_init": "orthogonal", "trainable": true, "activation": "tanh", "consume_less": "cpu", "W_regularizer": null, "go_backwards": false, "dropout_W": 0.0, "b_regularizer": null}, "class_name": "LSTM"}, {"config": {"output_dim": 1, "init": "glorot_uniform", "activation": "linear", "name": "dense_2", "input_dim": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}